
$(function(){


    var myTableOne = new mTable();
    var myOption = {
        'data': {
            'title': ['指标名称', '实际值', '目标值', '状态', '计算公式'],
            'content': [ 
                ['到达医院60分钟内实施溶栓治疗比例', '0.6%', '1.0%', '未完成', '(实施溶栓治疗人数/治疗总人数)*100%'], 
                ['到达医院60分钟内实施溶栓治疗比例', '0.6%', '1.0%', '未完成', '(实施溶栓治疗人数/治疗总人数)*100%'],
                ['到达医院60分钟内实施溶栓治疗比例', '0.6%', '1.0%', '未完成', '(实施溶栓治疗人数/治疗总人数)*100%'], 
                ['到达医院60分钟内实施溶栓治疗比例', '0.6%', '1.0%', '未完成', '(实施溶栓治疗人数/治疗总人数)*100%'], 
                ['到达医院60分钟内实施溶栓治疗比例', '0.6%', '1.0%', '未完成', '(实施溶栓治疗人数/治疗总人数)*100%'],
                ['到达医院60分钟内实施溶栓治疗比例', '0.6%', '1.0%', '未完成', '(实施溶栓治疗人数/治疗总人数)*100%'], 
            ]
        }
    }
    myTableOne.init({
        'dom': '#J_tableOne',
        'option': myOption
    })


    /*=================================
    =     指标趋势start            =
    =================================*/
    var domTrend = $(".patient-polyline"),
    dataTrend = [
        {
            name: '今年', 
            xAxis: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],
            isLine: false,
            data: [43, 23, 92, 60, 94, 110, 63, 26, 7, 33, 112, 42]
        },
        {
            name: '去年', 
            isLine: false,
            data: [60, 107, 28, 4, 87, 6, 47, 10, 27, 89, 3, 31]
        },
        {
            name: '目标',
            isLine: true,
            data: [80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]
        }
    ], 
    title = {text:'指标趋势', textStyle: {color:'#000', fontSize:'15',fontWight: 600}, top: '2%', left: '3%'},
    areaLineChart = new AreaLineChart();
    
    areaLineChart.init({dom:domTrend[0], title: title});
    
    areaLineChart.render(dataTrend);

    /*=====  指标趋势end  ======*/
})