
$(function(){




    var myTableOne = new mTable();
    var myOption = {
        'data': {
            'title': ['KPI名称', '权重', '得分', '评分规则', '实际值', '目标值', '差值', '加扣分', '起始日期', '加权得分'],
            'content': [ 
                ['门诊均次药品费用', '0.30', '90.00', '门诊药品均次', '116.2', '69.57', '-42.04', '42.04', '2016-01-23', '27.00'], 
                ['门诊均次药品费用', '0.30', '90.00', '门诊药品均次', '116.2', '69.57', '-42.04', '42.04', '2016-01-23', '27.00'], 
                ['门诊均次药品费用', '0.30', '90.00', '门诊药品均次', '116.2', '69.57', '-42.04', '42.04', '2016-01-23', '27.00'], 
                ['门诊均次药品费用', '0.30', '90.00', '门诊药品均次', '116.2', '69.57', '-42.04', '42.04', '2016-01-23', '27.00'], 
                ['门诊均次药品费用', '0.30', '90.00', '门诊药品均次', '116.2', '69.57', '-42.04', '42.04', '2016-01-23', '27.00'], 
                ['门诊均次药品费用', '0.30', '90.00', '门诊药品均次', '116.2', '69.57', '-42.04', '42.04', '2016-01-23', '27.00'], 
            ]
        }
    }
    myTableOne.init({
        'dom': '#J_tableOne',
        'option': myOption
    })

    /*=================================
    =     绩效组件start            =
    =================================*/

    var myPerformanceOne = new mPerformance();
    var myOption = {
        'data': {
            'name': '李燕妮',
            'pm': '13名',
            'df': '67.50',
            'trend': 'down',
            'tb': '2名',
        }
    }

    myPerformanceOne.init({
        'dom': '#J_performanceOne',
        'option': myOption,
    })

    /*=====  面板end  ======*/

    /*=================================
    =     下拉组件start            =
    =================================*/

    var mSelectOne = new mSelect();
    var myOption = {
        'mon': [1,2,3,4,5,6,7,8],
        'catalog': ['分院', '科室', '医生'],
        'data': 
            [
                {
                    '分院': [
                        {
                            'id': 1,
                            'name': '杭州分院'
                        },
                        {
                            'id': 2,
                            'name': '湖州分院'
                        }
                    ]
                },
                {
                    '科室': [
                        {
                            'pId': 1,
                            'content': [
                                {
                                    'id': 11,
                                    'name': '口腔科'
                                },
                                {
                                    'id': 12,
                                    'name': '内科'
                                }
                            ]
                        },
                        {
                            'pId': 2,
                            'content': [
                                {
                                    'id': 21,
                                    'name': '外科'
                                }
                            ]
                        }
                    ]
                },
                {
                    '医生': [
                        {
                            'pId': 11,
                            'content': [
                                {
                                    'id': 111,
                                    'name': '张三'
                                },
                                {
                                    'id': 112,
                                    'name': '李四'
                                }
                            ]
                        },
                        {
                            'pId': 12,
                            'content': [
                                {
                                    'id': 121,
                                    'name': '郭靖'
                                }
                            ]
                        },
                        {
                            'pId': 21,
                            'content': [
                                {
                                    'id': 211,
                                    'name': '杨过'
                                }
                            ]
                        }
                    ]
                }
            ]
    }

    mSelectOne.init({
        'dom': '#J_selectOne',
        'option': myOption,
    })

    /*=====  下拉框组件end  ======*/
})